app/Controllers/Admin.php

    public function dashboard(): string
    {
        $usersModel = new usersModel();
        $managersModel = new managersModel();

        // جمع عدد الموظفين من جدول users
        $employeesCount = $usersModel->countAll();

        // جمع عدد المديرين من جدول managers
        $managersCount = $managersModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `managers`

    public function adminEmployeesManagement()
    {
        $teamsModel = new teamModel();
        $data['departments'] = $teamsModel->findAll();

        $usersModel = new usersModel();
        $data['employees'] = $usersModel->findAll();

        // Load the managers model
        $managersModel = new managersModel();
        $data['managers'] = $managersModel->findAll();
---
SELECT *
FROM `teams`
SELECT *
FROM `users`
SELECT *
FROM `managers`