app/Controllers/Manager.php

SELECT *
FROM `managers`
WHERE `manager_id` = '3'
 LIMIT 1
SELECT *
FROM `users`
WHERE `Team_id` = '3'
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `employee_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `employee_id` = '1'
AND `state` != 'Pending'
---
    public function dashboard(): string
    {
        $session = session();
        $managerId = $session->get('user_id');

        $managerModel = new managersModel();
        $teamId = $managerModel->where('manager_id', $managerId)->first()['Team_id'];

        $documentsModel = new OrderSubmission_model();
        $userModel = new usersModel();

        // جلب الموظفين في نفس الفريق
        $employees = $userModel->where('Team_id', $teamId)->findAll();

        $progressData = [];

        foreach ($employees as $employee) {
            $userId = $employee['User_id'];

            // عدد المهام المستلمة
            $tasksReceived = $documentsModel->where('employee_id', $userId)->countAllResults();

            // عدد المهام المكتملة
            $tasksCompleted = $documentsModel->where('employee_id', $userId)->where('state !=', 'Pending')->countAllResults();

SELECT `reports`.*, `documents`.*, `teams`.`Team_name` as `team_name`, `managers`.`username` as `manager_name`, `users`.`username` as `username`, `documents`.`urgent` as `urgent`, `documents`.`cost` as `wordlen`, `documents`.`language` as `language`, `documents`.`target_language` as `language`
FROM `reports`
JOIN `documents` ON `reports`.`Translation_id` = `documents`.`Document_id`
JOIN `teams` ON `documents`.`Team_id` = `teams`.`Tid`
JOIN `users` ON `reports`.`user_id` = `users`.`User_id`
JOIN `managers` ON `teams`.`Tid` = `managers`.`Team_id`
WHERE `reports`.`status` = 'Open'
AND `managers`.`manager_id` = '3'
---
    public function load_tikcets()
    {
        $session = \Config\Services::session();
        $user_id = $session->get('user_id');

        $db = Database::connect();

        // Build the query with joins
        $builder = $db->table('reports');
        $builder->select('reports.*, documents.*, teams.Team_name as team_name, managers.username as manager_name, users.username as username, documents.urgent as urgent, documents.cost as wordlen, documents.language as language, documents.target_language as language');
        $builder->join('documents', 'reports.Translation_id = documents.Document_id');
        $builder->join('teams', 'documents.Team_id = teams.Tid');
        $builder->join('users', 'reports.user_id = users.User_id');
        $builder->join('managers', 'teams.Tid = managers.Team_id');
        $builder->where('reports.status', 'Open');
        $builder->where('managers.manager_id', $user_id);
        $query = $builder->get();

SELECT *
FROM `managers`
WHERE `manager_id` = '3'
 LIMIT 1
SELECT *
FROM `documents`
WHERE `employee_id` IS NULL
AND `Team_id` = '3'
SELECT `documents`.*, `users`.`username` as `employee_name`
FROM `documents`
INNER JOIN `users` ON `users`.`User_id` = `documents`.`employee_id`
WHERE `documents`.`Team_id` = '3'
AND `documents`.`employee_id` IS NOT NULL
SELECT *
FROM `users`
WHERE `Team_id` = '3'
---
    public function assignment()
    {

        $session = session();
        $managerId = $session->get('user_id');

        $managerModel = new managersModel();
        $teamId = $managerModel->where('manager_id', $managerId)->first()['Team_id'];

        $documentsModel = new OrderSubmission_model();
        $documents = $documentsModel->where('employee_id', null)->where('Team_id', $teamId)->findAll();
        $documentsinfo = $documentsModel
        ->select('documents.*, users.username as employee_name')
        ->join('users', 'users.User_id = documents.employee_id', 'inner')
        ->where('documents.Team_id', $teamId)
        ->where('documents.employee_id IS NOT NULL')
        ->findAll();

        $userModel = new usersModel();
        $employees = $userModel->where('Team_id', $teamId)->findAll();